---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.SpaceTag.SpaceTagType
source: html/fe2ef2e7-a378-40f1-388c-0acc0f03b1ab.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceTag.SpaceTagType Property

The tag type.

## Syntax (C#)
```csharp
public SpaceTagType SpaceTagType { get; set; }
```